Revit 2024 API
LinkElementId Constructor
Overload List
Name | Description
LinkElementId(ElementId)
 Creates a new LinkElementId representing an element in the host document.
LinkElementId(ElementId, ElementId)
 Creates a new LinkElementId representing an element in a linked document.
See Also
LinkElementId Class
LinkElementId Members
Autodesk.Revit.DB Namespace